You may need to run
```
conda install -c r rpy2  r-dplyr
```

In [1]:
%load_ext rpy2.ipython

### Make some data frames in Python

In [3]:
from pandas import DataFrame

In [13]:
d1 = {'name': ['a', 'b', 'c', 'd'], 'one' : [1., 2., 3., 4.], 'two' : [4., 3., 2., 1.]}
d2 = {'name': ['a', 'b', 'c', 'd'], 'three' : [11., 12., 13., 14.], 'four' : [41., 31., 21., 11.]}

In [16]:
df1 = DataFrame(d1)
df2 = DataFrame(d2)

In [17]:
df1

  name  one  two
0    a  1.0  4.0
1    b  2.0  3.0
2    c  3.0  2.0
3    d  4.0  1.0

In [18]:
df2

   four name  three
0  41.0    a   11.0
1  31.0    b   12.0
2  21.0    c   13.0
3  11.0    d   14.0

### Import into R, combine and export back to python

- The `-i` flag imports `pandas` dataframes into R
- The `-o` flag exports `R` dataframes into `pandas`

In [33]:
%%R -i df1,df2 -o df

suppressMessages(library(dplyr))
df <- inner_join(df1, df2, by="name")
df

  name one two four three
1    a   1   4   41    11
2    b   2   3   31    12
3    c   3   2   21    13
4    d   4   1   11    14

### Back in Python

In [34]:
df

   name  one  two  four  three
0     1  1.0  4.0  41.0   11.0
1     2  2.0  3.0  31.0   12.0
2     3  3.0  2.0  21.0   13.0
3     4  4.0  1.0  11.0   14.0